#+begin_src lisp
(recoder/org:header recoder/trd:*trd*)
#+end_src

#+RESULTS:
| Файл                                | D:/PRG/msys64/home/namatv/quicklisp/local-projects/clisp/recoder/trd/2018-11-06_092329.trd |
| Версия тренда                       |                                                                                          2 |
| Дата создания тренда                |                                                                                 2018-11-06 |
| Время создания тренда               |                                                                                   09:23:29 |
| К-во аналоговых+дискретных сигналов |                                                                                        415 |
| Общее число записей в тренде        |                                                                                      15706 |
| Интервал между записями тренда      |                                                                                     0.25d0 |
| Количество аналоговых сигналов      |                                                                                        314 |
| Количество дискретных сигналов      |                                                                                        101 |

#+begin_src lisp
(recoder/org:analog-signals recoder/trd:*trd*)
#+end_src

#+RESULTS:
|   0 | FP510    |   0.0d0 | 1.600000023841858d0 | МПа     | Избыточное давление газа перед суммирующ |
|   1 | FP520    |   0.0d0 |              16.0d0 | кПа     | Перепад давления газа на суммирующем РУ  |
|   2 | FP530    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление топливного газа пере |
|   3 | FP550    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление топливного газа пере |
|   4 | FP560    |   0.0d0 |               6.0d0 | кПа     | Перепад давления топливного газа на РУ 2 |
|   5 | FP570    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление топливного газа пере |
|   6 | FP580    |   0.0d0 |               6.0d0 | кПа     | Перепад давления топливного газа на РУ 3 |
|   7 | FP590    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление топливного газа пере |
|   8 | FP600    |   0.0d0 |              10.0d0 | кПа     | Перепад давления топливного газа на РУ 4 |
|   9 | FP610    |   0.0d0 |             600.0d0 | кПа     | Избыточное давление топливного газа в 1- |
|  10 | FP620    |   0.0d0 |             600.0d0 | кПа     | Избыточное давление топливного газа во 2 |
|  11 | FP540    |   0.0d0 |               6.0d0 | кПа     | Перепад давления топливного газа на РУ 1 |
|  12 | FP630    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление топливного газа в 3- |
|  13 | FP640    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление топливного газа в 4- |
|  14 | FT510    | -50.0d0 |             150.0d0 | °С      | Температура топливного газа в распредели |
|  15 | PP030    |   0.0d0 |              16.0d0 | кПа     | Перепад давления воздуха на РУ левой вет |
|  16 | PP020    |   0.0d0 |             100.0d0 | кПа     | Избыточное давление технологического воз |
|  17 | PP040    |   0.0d0 |             100.0d0 | кПа     | Избыточное давление технологического воз |
|  18 | PP050    |   0.0d0 |              16.0d0 | кПа     | Перепад давления воздуха на РУ правой ве |
|  19 | PT060    |   0.0d0 |             600.0d0 | °C      | Температура технологического воздуха пер |
|  20 | PT070    |   0.0d0 |             600.0d0 | °C      | Температура технологического воздуха пер |
|  21 | PT180    |   0.0d0 |             600.0d0 | °C      | Температура технологического воздуха пер |
|  22 | PT080    |   0.0d0 |             600.0d0 | °C      | Температура технологического воздуха пер |
|  23 | FT500    | -50.0d0 |             150.0d0 | °C      | Температура топливного газа перед суммир |
|  24 | T2       | -10.0d0 |             600.0d0 | °C      | Т2 - средняя                             |
|  25 | ET300    |   0.0d0 |            1600.0d0 | °C      | Т3 - средняя                             |
|  26 | ET301    |   0.0d0 |            1300.0d0 | °C      | Температура Т3 (ХА) т1                   |
|  27 | ET302    |   0.0d0 |            1300.0d0 | °C      | Температура Т3 (ХА) т2                   |
|  28 | ET303    |   0.0d0 |            1300.0d0 | °C      | Температура Т3 (ХА) т3                   |
|  29 | Gv       |   0.0d0 |              25.0d0 | кг/ч    | Расход воздуха на входе в КС             |
|  30 | V2       |   0.0d0 |              25.0d0 | м3/с    | Объемный расход воздуха                  |
|  31 | G_1      |   0.0d0 |            1000.0d0 | кг/ч    | Расход в 1-м канале                      |
|  32 | G_2      |   0.0d0 |            1000.0d0 | кг/ч    | Расход во 2-м канале                     |
|  33 | G_3      |   0.0d0 |            1000.0d0 | кг/ч    | Расход в 3-м канале                      |
|  34 | G_4      |   0.0d0 |            1000.0d0 | кг/ч    | Расход в 4-м канале                      |
|  35 | Gt       |   0.0d0 |            1000.0d0 | кг/ч    | Суммарный расчетный расход топлива       |
|  36 | G1       |   0.0d0 |            1000.0d0 | кг/ч    | Суммарный расход топлива                 |
|  37 | Gvv      |   0.0d0 |           10000.0d0 | кг/ч    | Расход воздуха высокого давления         |
|  38 | G        |   0.0d0 |           10000.0d0 | кг/ч    | массовый расход газа                     |
|  39 | dPx      |   0.0d0 |          100000.0d0 | Па      | перепад давления на сужающем устройстве  |
|  40 | Tx       |   0.0d0 |             100.0d0 | °C      | температура перед сужающим устройством   |
|  41 | Px       |   0.0d0 |         1000000.0d0 | Па      | давление перед сужающим устройством      |
|  42 | alpha    |   0.0d0 |            1000.0d0 |         | коэфициент расхода                       |
|  43 | eps      |   0.0d0 |            1000.0d0 |         | коэффициент расширения                   |
|  44 | rho      |   0.0d0 |            1000.0d0 |         | плотность газа                           |
|  45 | Pk       |   0.0d0 |               1.0d7 | Па      | псевдокритическое давление               |
|  46 | Tk       |   0.0d0 |            1000.0d0 | K       | псевдокритич. температура                |
|  47 | mu       |   0.0d0 |             100.0d0 |         | динамическая вязкость природного газа    |
|  48 | mu0      |   0.0d0 |             100.0d0 |         | заданная динамическая вязкость           |
|  49 | kapa     |   0.0d0 |              10.0d0 |         | показатель адиабаты                      |
|  50 | kapa0    |   0.0d0 |              10.0d0 |         | заданный показатель адиабаты             |
|  51 | Re       |   0.0d0 |          100000.0d0 |         | число Рейнольдса                         |
|  52 | Re_n     |   0.0d0 |         1000000.0d0 |         | уточненное значение числа Рейнольдса     |
|  53 | err      |   0.0d0 |               1.0d0 |         | относит. ошибка определения числа Re     |
|  54 | D        |   0.0d0 |             100.0d0 |         | внутренний диаметр трубопровода          |
|  55 | d        |   0.0d0 |             100.0d0 | мм      | диаметр сужающего устройства             |
|  56 | ksh      |   0.0d0 |             100.0d0 |         | поправочный множитель на шероховатость   |
|  57 | ksh0     |   0.0d0 |             100.0d0 |         | заданный поправочный множитель...        |
|  58 | kp       |   0.0d0 |             100.0d0 |         | поправочный множитель на притупление вх  |
|  59 | kp0      |   0.0d0 |             100.0d0 |         | заданный поправочный множитель...        |
|  60 | m        |   0.0d0 |             100.0d0 |         | модуль СУ                                |
|  61 | m2       |   0.0d0 |             100.0d0 |         | квадрат модуля СУ                        |
|  62 | Kp       |   0.0d0 |            1000.0d0 |         | комплексный коэффициент приведения давле |
|  63 | Kt       |   0.0d0 |             100.0d0 |         | комплексный коэффициент приведения темпе |
|  64 | Ppp      |   0.0d0 |             100.0d0 |         | псевдоприведенное избыточное давление    |
|  65 | Tpp      |   0.0d0 |             100.0d0 |         | псевдоприведенная температура            |
|  66 | K        |   0.0d0 |             100.0d0 |         | коэффициент сжимаемости газа             |
|  67 | K0       |   0.0d0 |             100.0d0 |         | заданный коэффициент сжимаемости         |
|  68 | a        |   0.0d0 |               1.0d0 |         |                                          |
|  69 | b        |   0.0d0 |               1.0d0 |         |                                          |
|  70 | c        |   0.0d0 |               1.0d0 |         |                                          |
|  71 | T        |   0.0d0 |             500.0d0 |         | Температура на входе в мерное устройство |
|  72 | P        |   0.0d0 |         1000000.0d0 |         | Полное давление на входе в мерное устрой |
|  73 | CYType   |   0.0d0 |               1.0d0 |         | Тип мерного устройства (0-диафрагма;1-со |
|  74 | Fuel     |   0.0d0 |               1.0d0 |         | Вид топлива                              |
|  75 | G_1p     |   0.0d0 |             100.0d0 | %       | расход топлива в первом канале %         |
|  76 | G_2p     |   0.0d0 |             100.0d0 | %       | расход топлива во втором канале %        |
|  77 | G_3p     |   0.0d0 |             100.0d0 | %       | расход топлива в третьем канале %        |
|  78 | d20      |   0.0d0 |             500.0d0 | мм      | Внутренний диаметр СУ                    |
|  79 | D20      |   0.0d0 |             500.0d0 | мм      | Внутренний диаметр трубопровода          |
|  80 | rhon     |   0.0d0 |               5.0d0 |         | плотность среды                          |
|  81 | G_4p     |   0.0d0 |             100.0d0 | %       | Расход топлива в 4-ом канале             |
|  82 | T3max    |   0.0d0 |            1600.0d0 | °C      |                                          |
|  83 | teta_max |   0.0d0 |            1000.0d0 |         |                                          |
|  84 | deltaT   |   0.0d0 |            2000.0d0 | °C      |                                          |
|  85 | M2       |   0.0d0 |               1.0d0 |         | Число маха на входе в КС                 |
|  86 | M3       |   0.0d0 |               1.0d0 |         | Число Маха на выходе из КС               |
|  87 | W2       |   0.0d0 |            1000.0d0 | м/с     | Скорость воздуха на входе в КС           |
|  88 | W3       |   0.0d0 |            1000.0d0 | м/с     | Скорость продуктов сгорания на выходе из |
|  89 | P02      |   0.0d0 |         1000000.0d0 | Па      | Полное давление на входе в КС            |
|  90 | P03      |   0.0d0 |         1000000.0d0 | Па      | Полное давление на  выходе из КС         |
|  91 | ro2      |   0.0d0 |              10.0d0 | кг/м3   | плотность воздуха на входе в КС          |
|  92 | ro3      |   0.0d0 |              10.0d0 | кг/м3   | плотность продуктов сгорания             |
|  93 | alpha_v  |   0.0d0 |             100.0d0 |         | Коэффициент избытка воздуха              |
|  94 | C_pv     |   0.0d0 |             100.0d0 |         | Удельная теплоемость воздуха             |
|  95 | C_p3     |   0.0d0 |             100.0d0 |         | Удельная теплоемкость продуктов сгорания |
|  96 | G3       |   0.0d0 |           10000.0d0 |         | Расход продуктов сгорания                |
|  97 | dzeta    |   0.0d0 |              10.0d0 |         | коэффициент гидравлического сопротивлени |
|  98 | eta      |   0.0d0 |             100.0d0 |         | Коэффициент полноты сгорания             |
|  99 | kapa3    |   0.0d0 |              10.0d0 |         | Показатель адиабаты продуктов сгорания   |
| 100 | r        |   0.0d0 |             100.0d0 |         |                                          |
| 101 | ET001    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 102 | ET002    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 103 | ET003    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 104 | ET004    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 105 | ET005    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 106 | ET006    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 107 | ET007    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 108 | ET008    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 109 | ET009    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 110 | ET010    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 111 | ET011    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 112 | ET012    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 113 | ET013    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 114 | ET014    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 115 | ET015    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 116 | ET016    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 117 | ET017    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 118 | ET018    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 119 | ET019    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 120 | ET020    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 121 | ET021    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 122 | ET022    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 123 | ET023    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 124 | ET024    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 125 | ET025    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 126 | ET026    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 127 | ET027    |   0.0d0 |            1600.0d0 | °C      | Температура родуктов сгорания на выходе  |
| 128 | ET028    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 129 | ET029    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 130 | ET030    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 131 | ET031    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 132 | ET032    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 133 | ET033    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 134 | ET034    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 135 | ET035    |   0.0d0 |            1600.0d0 | °C      | Температура прод. сгорания т.35          |
| 136 | ET036    |   0.0d0 |            1600.0d0 | °C      | Температура прод. сгорания т.36          |
| 137 | kapa_co  |   0.0d0 |               2.0d0 |         |                                          |
| 138 | P02_kg   |   0.0d0 |             100.0d0 | кгс/см2 | Полное давление на входе                 |
| 139 | P03_kg   |   0.0d0 |             100.0d0 | кгс/см2 | Полное давление на выходе                |
| 140 | Gsum     |   0.0d0 |          100000.0d0 | кг      | Суммарный расход топлива                 |
| 141 | PP090L   |   0.0d0 |             100.0d0 | кПа     | Избыточное давление продуктов сгорания н |
| 142 | PP090    |   0.0d0 |             100.0d0 | кПа     | Избыточное давление продуктов сгорания н |
| 143 | PP090R   |   0.0d0 |             100.0d0 | кПа     | Избыточное давление продуктов сгорания н |
| 144 | GsumDay  |   0.0d0 |           10000.0d0 | кг      | Суммарный расход топлива за 1 день       |
| 145 | VT001    |   0.0d0 |             100.0d0 | °C      | Температура охлаждающей воды (т.1)       |
| 146 | VT002    |   0.0d0 |             100.0d0 | °C      | Температура охлаждающей воды (т.2)       |
| 147 | VT003    |   0.0d0 |             100.0d0 | °C      | Температура охлаждающей воды (т.3)       |
| 148 | VT004    |   0.0d0 |             100.0d0 | °C      | Температура охлаждающей воды (т.4)       |
| 149 | VT005    |   0.0d0 |             100.0d0 | °C      | Температура охлаждающей воды (т.5)       |
| 150 | VT006    |   0.0d0 |             100.0d0 | °C      | Температура охлаждающей воды (т.6)       |
| 151 | FR019    |   0.0d0 |           65535.0d0 |         | режим работы клапана пускового газа      |
| 152 | PP060L   |   0.0d0 |             100.0d0 | кПа     | Избыточное давление технологического воз |
| 153 | PP060    |   0.0d0 |             100.0d0 | кПа     | Избыточное давление воздуха на входе в К |
| 154 | PP061R   |   0.0d0 |             100.0d0 | кПа     | Избыточное давление воздуха на входе в К |
| 155 | PP060R   |   0.0d0 |             100.0d0 | кПа     | Избыточное давление технологического воз |
| 156 | F11      |   0.0d0 |           10000.0d0 | Гц      | Первый датчик 1 частота                  |
| 157 | F12      |   0.0d0 |           10000.0d0 | Гц      | Первый датчик 2 частота                  |
| 158 | F13      |   0.0d0 |           10000.0d0 | Гц      | Первый датчик 3 частота                  |
| 159 | F14      |   0.0d0 |           10000.0d0 | Гц      | Первый датчик 4 частота                  |
| 160 | F15      |   0.0d0 |           10000.0d0 | Гц      | Первый датчик 5 частота                  |
| 161 | F21      |   0.0d0 |           10000.0d0 | Гц      | Второй датчик 1 частота                  |
| 162 | F22      |   0.0d0 |           10000.0d0 | Гц      | Второй датчик 2 частота                  |
| 163 | F23      |   0.0d0 |           10000.0d0 | Гц      | Второй датчик 3 частота                  |
| 164 | F24      |   0.0d0 |           10000.0d0 | Гц      | Второй датчик 4 частота                  |
| 165 | F25      |   0.0d0 |           10000.0d0 | Гц      | Второй датчик 5 частота                  |
| 166 | F31      |   0.0d0 |           10000.0d0 | Гц      | Третий датчик 1 частота                  |
| 167 | F32      |   0.0d0 |           10000.0d0 | Гц      | Третий датчик 2 частота                  |
| 168 | F33      |   0.0d0 |           10000.0d0 | Гц      | Третий датчик 3 частота                  |
| 169 | F34      |   0.0d0 |           10000.0d0 | Гц      | Третий датчик 4 частота                  |
| 170 | F35      |   0.0d0 |           10000.0d0 | Гц      | Третий датчик 5 частота                  |
| 171 | A11      |   0.0d0 |              10.0d0 | кПа     | Первый датчик 1 гармоника                |
| 172 | A12      |   0.0d0 |              10.0d0 | кПа     | Первый датчик 2 гармоника                |
| 173 | A13      |   0.0d0 |              10.0d0 | кПа     | Первый датчик 3 гармоника                |
| 174 | A14      |   0.0d0 |              10.0d0 | кПа     | Первый датчик 4 гармоника                |
| 175 | A15      |   0.0d0 |              10.0d0 | кПа     | Первый датчик 4 гармоника                |
| 176 | A21      |   0.0d0 |              10.0d0 | кПа     | Второй датчик 1 гармоника                |
| 177 | A22      |   0.0d0 |              10.0d0 | кПа     | Второй датчик 2 гармоника                |
| 178 | A23      |   0.0d0 |              10.0d0 | кПа     | Второй датчик 3 гармоника                |
| 179 | A24      |   0.0d0 |              10.0d0 | кПа     | Второй датчик 4 гармоника                |
| 180 | A25      |   0.0d0 |              10.0d0 | кПа     | Второй датчик 5 гармоника                |
| 181 | A31      |   0.0d0 |              10.0d0 | кПа     | Третий датчик 1 гармоника                |
| 182 | A32      |   0.0d0 |              10.0d0 | кПа     | Третий датчик 2 гармоника                |
| 183 | A33      |   0.0d0 |              10.0d0 | кПа     | Третий датчик 3 гармоника                |
| 184 | A34      |   0.0d0 |              10.0d0 | кПа     | Третий датчик 4 гармоника                |
| 185 | A35      |   0.0d0 |              10.0d0 | кПа     | Третий датчик 5 гармоника                |
| 186 | A1       |   0.0d0 |               1.0d0 | кПа     | Первый  датчик осредненное значение гарм |
| 187 | A2       |   0.0d0 |              10.0d0 | кПа     | Второй датчик осредненное значение гармо |
| 188 | A3       |   0.0d0 |              10.0d0 | кПа     | Третий датчик осредненное значение гармо |
| 189 | FP010    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление ДТ за подкачивающим  |
| 190 | FP020    |   0.0d0 |              10.0d0 | МПа     | Избыточное давление ДТ за рабочим насосо |
| 191 | FP030    |   0.0d0 |               6.0d0 | МПа     | Избыточное давление ДТ в 1 канале        |
| 192 | FP040    |   0.0d0 |               6.0d0 | МПа     | Избыточное давление ДТ во 2 канале       |
| 193 | FP050    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление ДТ в пусковом канале |
| 194 | FT010    |   0.0d0 |             100.0d0 | °С      | Температура ДТ за рабочим насосом        |
| 195 | FG010    |   0.0d0 |             100.0d0 | кг/ч    | Расход ДТ первого канала                 |
| 196 | FG020    |   0.0d0 |             100.0d0 | кг/ч    | Расход ДТ второго канала                 |
| 197 | PP010    |   0.0d0 |             600.0d0 | кПа     | Давление технического воздуха            |
| 198 | VP010    |   0.0d0 |            1000.0d0 | кПа     | Давление воды                            |
| 199 | VT010    |   0.0d0 |             150.0d0 | °C      | Температура воды на сливе                |
| 200 | VG010    |   0.0d0 |            1000.0d0 | кг/ч    | Расход воды                              |
| 201 | FN010    |   0.0d0 |             500.0d0 | Гц      | Массовый расход жидкого топлива (ТПР-1)  |
| 202 | FN020    |   0.0d0 |             500.0d0 | Гц      | Массовый расход жидкого топлива (ТПР-2)  |
| 203 | FN040    |   0.0d0 |             500.0d0 | Гц      | Массовый расход жидкого топлива          |
| 204 | FN030    |   0.0d0 |             500.0d0 | Гц      | Массовый расход технологической воды (ТП |
| 205 | VN010    |   0.0d0 |            1000.0d0 | Гц      | Частота вращения турбинки расходомера во |
| 206 | T-1      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.1)             |
| 207 | T-2      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.2)             |
| 208 | T-3      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.3)             |
| 209 | T-4      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.4)             |
| 210 | T-5      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.5)             |
| 211 | T-6      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.6)             |
| 212 | T-7      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.7)             |
| 213 | T-8      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.8)             |
| 214 | T-9      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.9)             |
| 215 | T-10     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.10)            |
| 216 | T-11     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.11)            |
| 217 | T-12     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.12)            |
| 218 | T-13     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.13)            |
| 219 | T-14     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.14)            |
| 220 | T-15     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.15)            |
| 221 | T-16     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.16)            |
| 222 | T-17     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.17)            |
| 223 | T-18     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.18)            |
| 224 | T-19     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.19)            |
| 225 | T-20     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.20)            |
| 226 | T-21     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.21)            |
| 227 | T-22     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.22)            |
| 228 | T-23     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.23)            |
| 229 | T-24     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.24)            |
| 230 | T-25     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.25)            |
| 231 | T-26     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.26)            |
| 232 | T-27     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.27)            |
| 233 | T-28     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.28)            |
| 234 | T-29     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.29)            |
| 235 | T-30     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.30)            |
| 236 | T-31     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.31)            |
| 237 | T-32     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.32)            |
| 238 | Т-33     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.33                        |
| 239 | Т-34     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.34                        |
| 240 | Т-35     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.35                        |
| 241 | Т-36     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.36                        |
| 242 | Т-37     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.37                        |
| 243 | Т-38     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.38                        |
| 244 | Т-39     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.39                        |
| 245 | Т-40     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.40                        |
| 246 | Т-41     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.41                        |
| 247 | T-42     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.42                        |
| 248 | Т-43     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.43                        |
| 249 | Т-44     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.44                        |
| 250 | Т-45     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.45                        |
| 251 | Т-46     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.46                        |
| 252 | Т-47     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.47                        |
| 253 | Т-48     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.48                        |
| 254 | Т-49     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.49                        |
| 255 | Т-50     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.50                        |
| 256 | Т-51     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.51                        |
| 257 | Т-52     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.52                        |
| 258 | Т-53     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.53                        |
| 259 | Т-54     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.54                        |
| 260 | Т-55     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.55                        |
| 261 | Т-56     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.56                        |
| 262 | Т-57     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.57                        |
| 263 | Т-58     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.58                        |
| 264 | Т-59     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.59                        |
| 265 | Т-60     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.60                        |
| 266 | Т-61     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.61                        |
| 267 | Т-62     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.62                        |
| 268 | Т-63     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.63                        |
| 269 | Т-64     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.64                        |
| 270 | T-65     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.65                        |
| 271 | T-66     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.66                        |
| 272 | T-67     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.67                        |
| 273 | T-68     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.68                        |
| 274 | T-69     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.69                        |
| 275 | T-70     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.70                        |
| 276 | T-71     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.71                        |
| 277 | T-72     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.72                        |
| 278 | T-73     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.73                        |
| 279 | T-74     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.74                        |
| 280 | T-75     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.75                        |
| 281 | T-76     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.76                        |
| 282 | T-77     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.77                        |
| 283 | T-78     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.78                        |
| 284 | T-79     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.79                        |
| 285 | T-80     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.80                        |
| 286 | T-81     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.па1                       |
| 287 | T-82     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.па2                       |
| 288 | T-83     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.па3                       |
| 289 | T-84     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.пг1                       |
| 290 | T-85     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.пг2                       |
| 291 | T-86     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.пг3                       |
| 292 | T-87     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.87                        |
| 293 | T-88     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.88                        |
| 294 | T-89     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.89                        |
| 295 | T-90     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.90                        |
| 296 | T-91     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.91                        |
| 297 | T-92     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.92                        |
| 298 | G_2k     |   0.0d0 |             250.0d0 | кг/ч    | Расход газа во 2 канале (CMF050)         |
| 299 | G_1k     |   0.0d0 |              60.0d0 | кг/ч    | Расход газа в 1 канале (CMF025)          |
| 300 | eta_kr   |   0.0d0 |             100.0d0 |         | Коэффициент полноты сгорания (кориолис)  |
| 301 | G3_kr    |   0.0d0 |           10000.0d0 |         | Расход продуктов сгорания (кориолис)     |
| 302 | Gdt      |   0.0d0 |            1000.0d0 | кг/ч    | Суммарный расход жидкого топлива         |
| 303 | Gg_otn   |   0.0d0 |             100.0d0 |         | Относительный расход газа                |
| 304 | Side     |   0.0d0 |               1.0d0 |         | Установка: Левая (Left)=0, Правая (Right |
| 305 | T2L      |   0.0d0 |            1000.0d0 | °C      | Т2 средняя левой ветки                   |
| 306 | Sd20_v   |   0.0d0 |            1000.0d0 |         | Внутренний диаметр СУ, мм                |
| 307 | SD20_v   |   0.0d0 |            1000.0d0 |         | Внутренний диаметр трубопровода, мм      |
| 308 | Sro_t    |   0.0d0 |               1.0d0 |         | Плотность газа при нормальных условиях   |
| 309 | SF3      |   0.0d0 |            1000.0d0 |         | Площадь сечения на выходе из КС, см2     |
| 310 | SQp      |   0.0d0 |           60000.0d0 |         | Низшая теплота сгорания                  |
| 311 | SB       |   0.0d0 |            1000.0d0 |         | Барометрическое давление, мм. рт. ст.    |
| 312 | T2R      |   0.0d0 |            1000.0d0 | °C      | Т2 средняя правой ветки                  |
| 313 | SF2      |   0.0d0 |            1000.0d0 |         | Площадь сечения на входе в кс, см2       |

#+begin_src lisp
(recoder/org:discret-signals recoder/trd:*trd*)
#+end_src

#+RESULTS:
|   0 | FH020 | Дроссельный кран рабочего насоса ДТ - от |
|   1 | FH021 | Дроссельный кран рабочего насоса ДТ - за |
|   2 | FA010 | Кран регулировки подачи ДТ 1-го канала - |
|   3 | FA011 | Кран регулировки подачи ДТ 1-го канала - |
|   4 | FA020 | Кран регулировки подачи ДТ 2-го канала - |
|   5 | FA021 | Кран регулировки подачи ДТ 2-го канала - |
|   6 | FK510 | Кран №41 топливного газа крановой площад |
|   7 | FK511 | Кран №41 топливного газа крановой площад |
|   8 | FK520 | Кран №42 топливного газа крановой площад |
|   9 | FK521 | Кран №42 топливного газа крановой площад |
|  10 | FK530 | Кран №43 топливного газа крановой площад |
|  11 | FK531 | Кран №43 топливного газа крановой площад |
|  12 | FK540 | Кран №46 топливного газа крановой площад |
|  13 | FK541 | Кран №46 топливного газа крановой площад |
|  14 | FA510 | Кран грубой регулировки топливного газа  |
|  15 | FA511 | Кран грубой регулировки топливного газа  |
|  16 | FA520 | Кран грубой регулировки топливного газа  |
|  17 | FA521 | Кран грубой регулировки топливного газа  |
|  18 | FA530 | Кран грубой регулировки топливного газа  |
|  19 | FA531 | Кран грубой регулировки топливного газа  |
|  20 | FA540 | Кран грубой регулировки топливного газа  |
|  21 | FA541 | Кран грубой регулировки топливного газа  |
|  22 | FA550 | Кран тонкой регулировки топливного газа  |
|  23 | FA551 | Кран тонкой регулировки топливного газа  |
|  24 | FA560 | Кран тонкой регулировки топливного газа  |
|  25 | FA561 | Кран тонкой регулировки топливного газа  |
|  26 | FA570 | Кран тонкой регулировки топливного газа  |
|  27 | FA571 | Кран тонкой регулировки топливного газа  |
|  28 | FA580 | Кран тонкой регулировки топливного газа  |
|  29 | FA581 | Кран тонкой регулировки топливного газа  |
|  30 | NJ010 | Загазованность бокса 9  - порог 0.5%     |
|  31 | NJ020 | Загазованность бокса 9 - порог 1%        |
|  32 | PH030 | Задвижка технологического воздуха левой  |
|  33 | PH031 | Задвижка технологического воздуха левой  |
|  34 | PH040 | Задвижка технологического воздуха правой |
|  35 | PH041 | Задвижка технологического воздуха правой |
|  36 | FH026 | Дроссельный кран рабочего насоса ДТ - от |
|  37 | FH027 | Дроссельный кран рабочего насоса ДТ - за |
|  38 | FA016 | Кран регулировки подачи жидкого топлива  |
|  39 | FA017 | Кран регулировки подачи жидкого топлива  |
|  40 | FA026 | Кран регулировки подачи жидкого топлива  |
|  41 | FA027 | Кран регулировки подачи жидкого топлива  |
|  42 | FR017 | Агрегат зажигания - отключить            |
|  43 | FR016 | Агрегат зажигания - включить             |
|  44 | FR018 | Клапан пускового газа                    |
|  45 | FK516 | Кран №41 топливного газа крановой площад |
|  46 | FK517 | Кран №41 топливного газа крановой площад |
|  47 | FK526 | Кран №42 топливного газа крановой площад |
|  48 | FK527 | Кран №42 топливного газа крановой площад |
|  49 | FK536 | Кран №43 топливного газа крановой площад |
|  50 | FK537 | Кран №43 топливного газа крановой площад |
|  51 | FK546 | Кран №46 топливного газа крановой площад |
|  52 | FK547 | Кран №46 топливного газа крановой площад |
|  53 | FA516 | Кран грубой регулировки топливного газа  |
|  54 | FA517 | Кран грубой регулировки топливного газа  |
|  55 | FA526 | Кран грубой регулировки топливного газа  |
|  56 | FA527 | Кран грубой регулировки топливного газа  |
|  57 | FA536 | Кран грубой регулировки топливного газа  |
|  58 | FA537 | Кран грубой регулировки топливного газа  |
|  59 | FA546 | Кран грубой регулировки топливного газа  |
|  60 | FA547 | Кран грубой регулировки топливного газа  |
|  61 | FA556 | Кран тонкой регулировки топливного газа  |
|  62 | FA557 | Кран тонкой регулировки топливного газа  |
|  63 | FA566 | Кран тонкой регулировки топливного газа  |
|  64 | FA567 | Кран тонкой регулировки топливного газа  |
|  65 | FA576 | Кран тонкой регулировки топливного газа  |
|  66 | FA577 | Кран тонкой регулировки топливного газа  |
|  67 | FA586 | Кран тонкой регулировки топливного газа  |
|  68 | FA587 | Кран тонкой регулировки топливного газа  |
|  69 | FR010 | Агрегат зажигания - включен              |
|  70 | FR011 | Агрегат зажигания - отключен             |
|  71 | PH036 | Задвижка технологического воздуха левой  |
|  72 | PH037 | Задвижка технологического воздуха левой  |
|  73 | PH046 | Задвижка технологического воздуха правой |
|  74 | PH047 | Задвижка технологического воздуха правой |
|  75 | PM016 | Аварийная вентиляция - включить          |
|  76 | NJ030 | Загазованность бокса 9 - отказ           |
|  77 | FH036 | Клапан слива 1-го канала                 |
|  78 | FH046 | Клапан слива 2 -го канала                |
|  79 | GAS   | Газообразное топливо                     |
|  80 | OIL   | Жидкое топливо                           |
|  81 | FM010 | Топливный насос - включен                |
|  82 | FM011 | Топливный насос - отключен               |
|  83 | VM010 | Насос воды - включен                     |
|  84 | VM011 | Насос воды - отключен                    |
|  85 | PH010 | Кран регулировки подачи техн. воздуха -  |
|  86 | PH011 | Кран регулировки подачи техн. воздуха -  |
|  87 | VH010 | Кран регулировки подачи питьевой воды -  |
|  88 | VH011 | Кран регулировки подачи питьевой воды -  |
|  89 | FM016 | Рабочий насос ДТ - включить              |
|  90 | FM017 | Рабочий насос ДТ - отключить             |
|  91 | VM016 | Насос воды - включить                    |
|  92 | VM017 | Насос воды - отключить                   |
|  93 | PH016 | Кран регулировки подачи технического воз |
|  94 | PH017 | Кран регулировки подачи технического воз |
|  95 | VH016 | Кран регулировки подачи воды - открыть   |
|  96 | VH017 | Кран регулировки подачи воды - закрыть   |
|  97 | VH026 | Кран перепуска воды - открыть            |
|  98 | VH027 | Кран перепуска воды - закрыть            |
|  99 | FH010 | Кран подачи ДТ - открыт                  |
| 100 | FH011 | Кран подачи ДТ - закрыт                  |
